[
  {
    "id": 1,
    "title": "Deva_2025_Hindi_WEBRip_720p_x264_AVC_HE_AAC_2_0_Vegamovies_is_mkv.mp4",
    "category": "bollywood",
    "language": "hindi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMFZ8jAAAGRnMP2xAMbceDIhA1PIqcQAAKoFAACZwMxVpRoKhRsizEOHgQ",
    "description": "Deva (2025) ek high-octane action thriller hai jisme Shahid Kapoor ek fearless aur rebellious police officer ka role निभा रहे hain. Film ek intense investigation aur badle ki kahani ko dikhati hai, jisme power-packed action aur emotional depth dono milenge.\n\nDirector: Rosshan Andrrews\n\nLead Actor: Shahid Kapoor\n\nGenre: Action, Thriller\n\nRelease Year: 2025\n\nShahid Kapoor ka raw and intense avatar dekhne ke liye tayyar ho jao! 🚔🔥🎬"
  },
  {
    "id": 2,
    "title": "Aashram_(2025)_S03_Part_2_Hindi_Series_720p_Web-DL.mkv",
    "category": "web series",
    "language": "hindi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMRZ8jA8CXlg_vvwUuKJ5QM-9wzj3AAAicWAALRhUhWjLhjaIdeTlIeBA",
    "description": "Aashram 2025 – The Dark Empire Continues!\n\nDirected by Prakash Jha, this gripping crime drama features Bobby Deol as the enigmatic Baba Nirala, a self-styled godman whose benevolent facade conceals a web of criminal activities. As his influence grows, so do the challenges from those seeking to expose his true nature. The series also stars Aaditi Pohankar as Pammi, Chandan Roy Sanyal as Bhopa Swami, and Darshan Kumar as Ujagar Singh. In the latest season, power struggles intensify within the ashram, with betrayal and vengeance taking center stage. Pammi's quest for justice leads to unexpected alliances, threatening Baba Nirala's empire."
  },
  {
    "id": 3,
    "title": "Hasrat_An_Uncommon_Love_Story_2025_Punjabi_Movie_1080p_Web_DL.mp4",
    "category": "regional",
    "language": "punjabi",
    "file_id": "BAACAgUAAyEFAASRfUoMAAMTZ8jB-8DIsKGkX0UnqCt1NwZEfvAAAjIWAALRhUhWxDKJU2dcIXoeBA",
    "description": "Hasrat (2025) – An Uncommon Love Story\n\nDirected by Devi Sharma, this Punjabi romantic drama stars Sumit Manak, Prabh Grewal, Deedar Gill, Lakhwinder, and Divjot Kaur. The film explores the complexities of rekindled love as former lovers reunite after years apart, facing societal taboos and family pressures."
  },
  {
    "id": 4,
    "title": "Illti_(2025)_Punjabi_Movie_720p_HDCAM.mkv",
    "category": "regional",
    "language": "punjabi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMVZ8jC9Em0nayMe098ul9d_p5uascAAjoWAALRhUhWXC8q-dx8fM4eBA",
    "description": "Illti (2025) – A Hilarious Punjabi Comedy!\n\nDirected by Varinder Ramgarhia, this Punjabi-language comedy film stars Jagjeet Sandhu and Tania in lead roles. The movie is produced by KV Dhillon and Jagjeet Sandhu under the banner of Jagjeet Sandhu Films. Set to release on February 14, 2025, 'Illti' promises a delightful blend of humor and drama, offering audiences a captivating cinematic experience."
  },
  {
    "id": 5,
    "title": "Majhail_(2025)_Punjabi_Movie_720p_HDCAM.mkv",
    "category": "regional",
    "language": "punjabi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMXZ8jDhVQxvBtt8Nxk3igBICvUApcAAj8WAALRhUhWMoQxbDu0wDIeBA",
    "description": "Majhail (2025) – A Riveting Punjabi Action Drama\n\nDirected by Dheeraj Kedarnath Rattan, 'Majhail' is a Punjabi-language action film featuring Dev Kharoud, Roopi Gill, and Guggu Gill in pivotal roles. The narrative follows Baldev Bath, a member of a drug cartel, as he seeks revenge against the Sandhu cartel. Amidst this turmoil, Dev infiltrates the underworld, aiming to dismantle the cartel from within."
  },
  {
    "id": 6,
    "title": "Moana_2_2024_WEB_DL_Hindi_+_English_1080p_10bit_x265_HEVC_AAC_5.mkv",
    "category": "Kids",
    "language": "hindi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMaZ8jEscxSeyTz5knLG4R5RFFiPV8AAnsWAALRhUhWSNC18LtELzEeBA",
    "description": "Moana 2 (2024) – A New Oceanic Adventure\n\nDirected by David G. Derrick Jr., Jason Hand, and Dana Ledoux Miller, this animated sequel features Auli'i Cravalho reprising her role as Moana, alongside Dwayne Johnson as Maui. Set three years after the original film, Moana embarks on a daring voyage to explore uncharted territories beyond Motunui, seeking to connect with other oceanic communities."
  },
  {
    "id": 7,
    "title": "Mufasa The Lion King 2024 PreDVD 1080p Hindi x264 AVC 2.0.mkv",
    "category": "Kids",
    "language": "hindi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAMdZ8jFL7Xh2h1biLvcjQABU2X1pt18AAJ_FgAC0YVIVsfnpifklrRBHgQ",
    "description": "Mufasa: The Lion King (2024)\n\nDirected by Barry Jenkins, this prequel to The Lion King explores the origin story of Mufasa (voiced by Aaron Pierre), from his struggles as an orphaned cub to becoming the beloved king of the Pride Lands. The film also delves into his complex relationship with his brother Taka, later known as Scar (played by Kelvin Harrison Jr.).\n\nFeaturing a voice cast that includes Seth Rogen as Pumbaa, Billy Eichner as Timon, and Beyoncé as Nala, the film offers an emotional journey of family, power, and destiny.\n\nReleased: December 2024."
  },
  {
    "id": 8,
    "title": "Ramayana__The_Legend_Of_Prince_Rama_(2025)_Hindi_Movie_1080p_Web-DL.mp4",
    "category": "Kids",
    "language": "hindi",
    "file_id": "BAACAgUAAyEFAASRfUoMAAMfZ8jF1LOG5XVEU6sTg3xJT-YtwYwAAoQWAALRhUhWgk8pdaO5q2oeBA",
    "description": "Ramayana: The Legend of Prince Rama is an animated film originally released in 1993, created through a collaboration between India and Japan. Directed by Yugo Sako, the movie is based on the ancient Indian epic, the Ramayana. It tells the tale of Prince Rama, his devotion, and his battles to rescue his wife Sita from the demon king Ravana.\n\nIn 2025, the film was re-released in 4K remastered version across theaters in India. It is now available in multiple languages, including Hindi, English, Tamil, and Telugu.\n\nThe movie has been celebrated for its beautiful animation and faithful representation of one of India's greatest epics."
  },
  {
    "id": 9,
    "title": "Jarnail_The_Warrior_2025_1080p_Punjabi_WEB_DL_2_0_ESub_x264_Vegamovies.mkv",
    "category": "regional",
    "language": "punjabi",
    "file_id": "BQACAgUAAyEFAASRfUoMAAM-Z8net6_GTWbVR-Kgw680AAFIZ8R3AAJ0EAACB1JQVuZyR7jQXT9tNgQA",
    "description": "Jarnail 2025 – Ek Zabardast Action Thriller Movie!Jarnail 2025 ek futuristic action thriller hai jisme modern warfare, patriotism, aur heroism ka perfect blend hai. Is film ki kahani ek fearless leader ke irgird ghoomti hai jo advanced technology aur high-tech weapons ke beech apne desh ki raksha karta hai."
  }
]